***** Function as Parameter
So one typical usage of function as parameter is =map=, so you can 
#+BEGIN_SRC javascript
[1,2,3,4].map(function(x){return ++x})
// => [2,3,4,5]
#+END_SRC

Think about how we gonna implement the same thing if not using map:

#+BEGIN_SRC js
  var array = [1,2,3,4];
  var result = [];
  for(var i in array){
    result.push(++i);
  }
  console.log(result);
#+END_SRC

#+RESULTS:
| 1 | 2 | 3 | 4 |

The old imperative code just look more lower lever, no any abstraction at all, programmer need to think about nearly every step the machine can understand. But with the abstraction of =map= for /Array/, we kind of just don't care about how the Array should be iterated -- the process, we need to specify what we want to do with each element, and Array will take care of everything else.

*** Immutable Data Structure

First thing JS really missing is /Immutable Datastrcuture/, which mean thing that once created can never be changed. What I mean missing is, for example, a very common code in JS like this:
#+BEGIN_SRC js
var a = [1, 2, 3];
a.push(4);
#+END_SRC

Now, a is something else, not =[1, 2, 3]= anymore, it's modified to =[1, 2, 3, 4]=.

Comparing to Clojure, who's datastructure is almost all immutable, we cannot do anything to modify a thing, instead, it should return a new one instead.

#+BEGIN_QUOTE
There're 6 primitive types in JavaScript, Boolean, Null, Undefined, Number and String(and Symbol in ES6). All primitive type is immutable, so Object is only mutable type.
#+END_QUOTE
 
#+BEGIN_SRC clojure
(def a [1 2 3])
(conj a 4) ;; => [1 2 3 4]
a ;; => [1 2 3]
#+END_SRC

#+RESULTS:
: #'user/a[1 2 3 4][1 2 3]

As you can see, nothing is change here, a is still =[1 2 3]=, but =conj= return a pretty new Vector, instead of modifing a.

